src/cf/Documents/ОтражениеНДСКВычету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОтражениеНДСКВычету</Name>
			<BasedOn>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
				<xr:Item>Document.СчетФактура</xr:Item>
				<xr:Item>Document.ОтчетКомиссионера</xr:Item>
				<xr:Item>Document.ДополнительныеРасходы</xr:Item>
				<xr:Item>Document.ПринятиеКУчетуВА</xr:Item>
				<xr:Item>Document.ОтчетПереработчика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДСПредъявленный</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПокупок</xr:Item>
				<xr:Item>InformationRegister.ЖурналУчетаСчетовФактур</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрямаяЗаписьВКнигу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьПроводки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьДополнительногоЛиста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректируемыйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуВА</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНДСКВычету</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключенВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДокументРасчетовКакСчетФактуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВСоставеПартийИКосвенныхРасходов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетовСКонтрагентом</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыИУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦенности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ВнеоборотныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроисхождения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СобытияПоНДСПокупки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОплаты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.ПринятиеКУчетуВА</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.Операция</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
								<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ДанныеПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПервичныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоУниверсальныйДокумент</Name>
					<Comment>УПД, УКД</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоКорректировочныйДокумент</Name>
					<Comment>УКД</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПокупок</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемИПередачаВРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеНулевойСтавкиНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейРаздела7ДекларацииНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеОплатыНДСВБюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПродаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНДСКВычету</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыПриИмпорте</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоПлатежнымКартам</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ОтражениеНДСКВычету/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВремяДокументаПоУмолчанию() Экспорт
	
	Возврат Новый Структура("Часы, Минуты", 20, 0);
	
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

Функция ТекстЗапросаДанныеДляОбновленияЦенДокументов() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ОтражениеНДСКВычетуТоварыИУслуги.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ОтражениеНДСКВычетуТоварыИУслуги.Цена КАК Цена,
	|	&Валюта КАК Валюта,
	|	&СпособЗаполненияЦены,
	|	&ЦенаВключаетНДС
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	Документ.ОтражениеНДСКВычету.ТоварыИУслуги КАК ОтражениеНДСКВычетуТоварыИУслуги
	|ГДЕ
	|	ОтражениеНДСКВычетуТоварыИУслуги.Ссылка = &Ссылка
	|	И ОтражениеНДСКВычетуТоварыИУслуги.Номенклатура ССЫЛКА Справочник.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Цена,
	|	Валюта";
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУНФКлиентСервер.ТекстРазделителяЗапросовПакета();
	
	Возврат ТекстЗапроса;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Определяет предъявлена ли сумма НДС по документу
//
// Параметры:
// ТекущийДокумент - документ, сумму НДС которого нужно вычислить
//
// Возвращаемое значение:
// Булево - если сумма НДС в документе не нулевая
Функция НаличиеСуммыНДС(ТекущийДокумент) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ОтражениеНДСКВычетуТоварыИУслуги.СуммаНДС) КАК СуммаНДС,
	|	ОтражениеНДСКВычетуТоварыИУслуги.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтражениеНДСКВычету.ТоварыИУслуги КАК ОтражениеНДСКВычетуТоварыИУслуги
	|ГДЕ
	|	ОтражениеНДСКВычетуТоварыИУслуги.Ссылка = &СсылкаНаДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтражениеНДСКВычетуТоварыИУслуги.Ссылка";

	Запрос.УстановитьПараметр("СсылкаНаДокумент", ТекущийДокумент);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.СуммаНДС > 0;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ТекстЗапросаДанныеДляПечатиСчетовФактур(НомераТаблиц) Экспорт
	
	НомераТаблиц.Вставить("Реквизиты",                 НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК ДатаОснования,
	|	Реквизиты.Организация КАК Организация,
	|	&ПустоеПодразделение КАК Подразделение,
	|	"""" КАК ЦифровойИндексОбособленногоПодразделения,
	|	Реквизиты.Организация КАК Поставщик,
	|	Реквизиты.Организация.ИНН КАК ИННпоставщика,
	|	Реквизиты.Организация КАК ОбособленноеПодразделениеПоставщика,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	Реквизиты.Организация КАК Покупатель,
	|	Реквизиты.Организация.ИНН КАК ИННпокупателя,
	|	Реквизиты.Организация КАК ОбособленноеПодразделениеПокупателя,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаВзаиморасчетов,
	|	ЛОЖЬ КАК РасчетыВУсловныхЕдиницах,
	|	НЕОПРЕДЕЛЕНО КАК ВидДоговора,
	|	НЕОПРЕДЕЛЕНО КАК Основание,
	|	НЕОПРЕДЕЛЕНО КАК ОснованиеДата,
	|	НЕОПРЕДЕЛЕНО КАК ОснованиеНомер,
	|	ЛОЖЬ КАК ЕстьТовары,
	|	"""" КАК АдресДоставки,
	|	"""" КАК СведенияОТранспортировкеИГрузе,
	|	НЕОПРЕДЕЛЕНО КАК ОтветственныйЗаОформление,
	|	"""" КАК СопроводительныеДокументы,
	|	НЕОПРЕДЕЛЕНО КАК Перевозчик,
	|	ЛОЖЬ КАК ПеревозкаАвтотранспортом
	|ИЗ
	|	Документ.ОтражениеНДСКВычету КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабЧасти,
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	"""" КАК Товар,
	|	"""" КАК ТоварКод,
	|	"""" КАК ТоварАртикул,
	|	"""" КАК ТоварНаименование,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК ПредставлениеСтраны,
	|	"""" КАК НомерГТД,
	|	"""" КАК ПредставлениеГТД,
	|	"""" КАК РегистрационныйНомерТД,
	|	"""" КАК ЕдиницаИзмерения,
	|	0 КАК Количество,
	|	0 КАК Цена,
	|	0 КАК Сумма,
	|	0 КАК СуммаНДС,
	|	0 КАК СтавкаНДС,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	ИСТИНА КАК СуммаВключаетНДС,
	|	&ДокументОснование КАК Ссылка,
	|	ЛОЖЬ КАК ЭтоКомиссия,
	|	0 КАК ВсегоРуб,
	|	0 КАК НДСРуб,
	|	0 КАК СуммаБезНДСРуб,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК КонтрагентСводныйСФ,
	|	НЕОПРЕДЕЛЕНО КАК ПериодичностьУслуги,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка) КАК ТоварКодТНВЭД,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	0 КАК НалоговаяБазаНДС,
	|	0 КАК СуммаАкциза
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.ОтражениеНДСКВычету.ТоварыИУслуги КАК ТаблицаТовары
	|ГДЕ
	|	ЛОЖЬ";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияУНФКлиентСервер.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить("УдалитьПредъявленСчетФактура");
	МассивРеквизитов.Добавить("УдалитьНомерВходящегоСчетаФактуры");
	МассивРеквизитов.Добавить("УдалитьДатаВходящегоСчетаФактуры");
	МассивРеквизитов.Добавить("УдалитьНДСПредъявленКВычету");
	МассивРеквизитов.Добавить("УдалитьКодСпособаПолучения");
	
	Возврат МассивРеквизитов;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПОДГОТОВКА ПАРАМЕТРОВ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    Реквизиты.Дата КАК Период,
	|    Реквизиты.Организация КАК Организация,
	|    Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|    ВЫБОР
	|        КОГДА Реквизиты.ИспользоватьДокументРасчетовКакСчетФактуру
	|        И Реквизиты.РасчетныйДокумент ССЫЛКА Документ.СчетФактураПолученный
	|            ТОГДА ВЫРАЗИТЬ(Реквизиты.РасчетныйДокумент КАК Документ.СчетФактураПолученный).Договор
	|        КОГДА Реквизиты.ИспользоватьДокументРасчетовКакСчетФактуру
	|        И Реквизиты.РасчетныйДокумент ССЫЛКА Документ.СчетФактура
	|            ТОГДА ВЫРАЗИТЬ(Реквизиты.РасчетныйДокумент КАК Документ.СчетФактура).Договор
	|        ИНАЧЕ Реквизиты.Договор
	|    КОНЕЦ КАК ДоговорКонтрагента,
	|    Реквизиты.Договор.ВалютаРасчетов КАК ВалютаВзаиморасчетов,
	|    ЕСТЬNULL(Реквизиты.Договор.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|    Реквизиты.Договор.ВидДоговора КАК ВидДоговора,
	|    Реквизиты.Договор.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|    Реквизиты.ИспользоватьДокументРасчетовКакСчетФактуру,
	|    Реквизиты.ЗаписьДополнительногоЛиста,
	|    Реквизиты.Представление,
	|    Реквизиты.РасчетныйДокумент,
	|    Реквизиты.Ссылка КАК Регистратор,
	|    Реквизиты.ПрямаяЗаписьВКнигу,
	|    Реквизиты.Контрагент,
	|    Реквизиты.Ссылка,
	|    Реквизиты.НДСВключенВСтоимость,
	|    Реквизиты.СуммаВключаетНДС,
	|    Реквизиты.КорректируемыйПериод,
	|    Реквизиты.КурсВзаиморасчетов,
	|    Реквизиты.КратностьВзаиморасчетов,
	|    Реквизиты.ФормироватьПроводки
	|ИЗ
	|    Документ.ОтражениеНДСКВычету КАК Реквизиты
	|ГДЕ
	|    Реквизиты.Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить();
		
	ПараметрыПроведения.Вставить("Реквизиты", Результат.Выгрузить());
	
	Реквизиты = ПараметрыПроведения.Реквизиты[0];
	
	СтруктураРеквизиты = Новый Структура("ВалютаРеглУчета,ВалютаДокумента,ВалютаВзаиморасчетов,Договор,ВидДоговора,Ссылка,СуммаВключаетНДС,
		|КурсВзаиморасчетов,КратностьВзаиморасчетов,КурсДокумента,КратностьДокумента,РасчетыВУсловныхЕдиницах,ОрганизацияПрименяетУСН,НачислятьНДСПоОтгрузке"); 
	
	ЗаполнитьЗначенияСвойств(СтруктураРеквизиты, Реквизиты);
	
	Если НЕ УчетнаяПолитика.Существует(Реквизиты.Организация, Реквизиты.Период)  Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;
	
	СтруктураРеквизиты.ОрганизацияПрименяетУСН = УчетнаяПолитика.СистемаНалогообложения(Реквизиты.Организация, Реквизиты.Период) = Перечисления.СистемыНалогообложения.Упрощенная;
//	СтруктураРеквизиты.НачислятьНДСПоОтгрузке = УчетнаяПолитика.НачислятьНДСПоОтгрузке(Реквизиты.Организация, Реквизиты.Период);
    СтруктураРеквизиты.НачислятьНДСПоОтгрузке = Ложь;
	СтруктураРеквизиты.ВалютаРеглУчета = Константы.НациональнаяВалюта.Получить();
	
	Если СтруктураРеквизиты.ВалютаВзаиморасчетов = СтруктураРеквизиты.ВалютаРеглУчета Тогда
		СтруктураРеквизиты.КурсДокумента		= 1;
		СтруктураРеквизиты.КратностьДокумента	= 1;
	Иначе
		СтруктураРеквизиты.КурсДокумента		= СтруктураРеквизиты.КурсВзаиморасчетов;
		СтруктураРеквизиты.КратностьДокумента	= СтруктураРеквизиты.КратностьВзаиморасчетов;
	КонецЕсли;
	
	Если СтруктураРеквизиты.ВалютаВзаиморасчетов = СтруктураРеквизиты.ВалютаДокумента Тогда
		СтруктураРеквизиты.КурсВзаиморасчетов		= 1;
		СтруктураРеквизиты.КратностьВзаиморасчетов	= 1;
	Иначе
		СтруктураРеквизиты.КурсВзаиморасчетов		= СтруктураРеквизиты.КурсВзаиморасчетов; 
		СтруктураРеквизиты.КратностьВзаиморасчетов	= СтруктураРеквизиты.КратностьВзаиморасчетов;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВалютаРеглУчета",		СтруктураРеквизиты.ВалютаРеглУчета);
	Запрос.УстановитьПараметр("ПрямаяЗаписьВКнигу",		Реквизиты.ПрямаяЗаписьВКнигу);
	Запрос.УстановитьПараметр("ФормироватьПроводки",	Реквизиты.ФормироватьПроводки);
	Запрос.УстановитьПараметр("СуммаВключаетНДС",		СтруктураРеквизиты.СуммаВключаетНДС);
	Запрос.УстановитьПараметр("РасчетныйДокументКакСчетФактура",
		УчетНДСПереопределяемый.ПолучитьСчетФактуруДляЗаписиВРегистрыНДС(Реквизиты.РасчетныйДокумент));
	Запрос.УстановитьПараметр("МассивВидовЦенностейУчитывающихсяПоДоговорам", 
		Перечисления.ВидыЦенностей.МассивВидовЦенностейУчитывающихсяПоДоговорам());
		
	ПодготовитьТаблицыДокументаДляЦелейПриобретенияРеализации(Запрос, СтруктураРеквизиты);
	
	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаТоварыИУслуги(НомераТаблиц)
		+ ТекстЗапросаДокументыОплаты(НомераТаблиц)
		+ ТекстЗапросаПрямаяЗаписьВКнигуПокупок(НомераТаблиц)
		+ ТекстЗапросаХозрасчетный(НомераТаблиц)
		+ ТекстЗапросаНДСПредъявленный(НомераТаблиц)
		+ ТекстЗапросаРублевыеСуммыДокументовВВалюте(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции

Процедура ПодготовитьТаблицыДокументаДляЦелейПриобретенияРеализации(Запрос, Реквизиты)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    ТоварыИУслуги.Ссылка,
	|    ТоварыИУслуги.НомерСтроки,
	|    ТоварыИУслуги.Номенклатура,
	|    ТоварыИУслуги.ВидЦенности КАК ВидЦенности,
	|    ТоварыИУслуги.СтавкаНДС КАК СтавкаНДС,
	|    ТоварыИУслуги.Сумма,
	|    ТоварыИУслуги.СуммаНДС КАК НДС,
	|    ТоварыИУслуги.Сумма - ТоварыИУслуги.СуммаНДС КАК СуммаБезНДС,
	|    ТоварыИУслуги.СчетЗатрат,
	|    ТоварыИУслуги.СчетУчетаНДС КАК СчетУчетаНДС,
	|    ТоварыИУслуги.Событие КАК Событие,
	|    ВЫБОР
	|        КОГДА ТоварыИУслуги.Ссылка.Дата < ДАТАВРЕМЯ(2015, 1, 1)
	|            ТОГДА """"
	|        ИНАЧЕ ТоварыИУслуги.Ссылка.КодВидаОперации
	|    КОНЕЦ КАК КодВидаОперации
	|ИЗ
	|    Документ.ОтражениеНДСКВычету.ТоварыИУслуги КАК ТоварыИУслуги
	|ГДЕ
	|    ТоварыИУслуги.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаТоварыУслуги = РезультатЗапроса[0].Выгрузить();

	ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаТоварыУслуги, Реквизиты);
	
	Запрос.УстановитьПараметр("ТаблицаТоварыУслуги", ТаблицаТоварыУслуги);
		
КонецПроцедуры

Процедура ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаЗначений, Реквизиты, ВключитьНДСВОсновнуюСумму = Истина) Экспорт
	
	Перем СуммаВключаетНДС,ВидРасчетовПоДоговору;
	
	ВалютаРегламентированногоУчета = Реквизиты.ВалютаРеглУчета;
	
	ЕстьНДС = ТаблицаЗначений.Колонки.Найти("НДС") <> Неопределено;
	ЕстьСтавкаНДС = ТаблицаЗначений.Колонки.Найти("СтавкаНДС") <> Неопределено;
	ЕстьВалюта = Реквизиты.Свойство("ВалютаДокумента");
	
	Если ЕстьВалюта И ЕстьНДС И ЕстьСтавкаНДС И Реквизиты.ВалютаДокумента <> ВалютаРегламентированногоУчета Тогда
		РасчетСуммыНДСПоСтавке =  Истина;
	Иначе
		РасчетСуммыНДСПоСтавке = Ложь;
	КонецЕсли; 
	
	Реквизиты.Свойство("СуммаВключаетНДС", СуммаВключаетНДС);
	СуммаВключаетНДС = (СуммаВключаетНДС = Истина);
	
	// Дополним колонки ТЗ при необходимости
	СтруктураОбязательныхКолонок = Новый Структура("Сумма" + ?(ЕстьНДС, ",НДС,СуммаБезНДС", "") + ?(ЕстьВалюта, ",СуммаВал" + ?(ЕстьНДС, ",НДСВал,СуммаБезНДСВал", ""), ""));
	
	СтруктураОбязательныхКолонок.Вставить("СуммаБУ");
	Если ЕстьНДС Тогда
		СтруктураОбязательныхКолонок.Вставить("СуммаБУБезНДС");
	КонецЕсли;
	
	Для каждого Колонка Из СтруктураОбязательныхКолонок Цикл
		
		Если ТаблицаЗначений.Колонки.Найти(Колонка.Ключ) = Неопределено тогда
			ТаблицаЗначений.Колонки.Добавить(Колонка.Ключ, ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
		КонецЕсли;
		
	КонецЦикла;
	
	//Дополним колонки ТЗ при необходимости нечисловыми полями
	Если ТаблицаЗначений.Колонки.Найти("СчетУчетаЦенности") = Неопределено тогда
		ТаблицаЗначений.Колонки.Добавить("СчетУчетаЦенности");
	КонецЕсли;
	
	Если ТаблицаЗначений.Колонки.Найти("ВидЦенности") = Неопределено тогда
		ТаблицаЗначений.Колонки.Добавить("ВидЦенности");
	КонецЕсли;
	
	Если ТаблицаЗначений.Колонки.Найти("Ценность") = Неопределено тогда
		ТаблицаЗначений.Колонки.Добавить("Ценность");
	КонецЕсли;
	
	Если ТаблицаЗначений.Колонки.Найти("Тара") = Неопределено тогда
		ТаблицаЗначений.Колонки.Добавить("Тара", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	// Определим суммы по документу (Сумму без НДС и корректную основную сумму)
	Если ЕстьНДС тогда
		
		Для каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
			СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма - ?(СуммаВключаетНДС, СтрокаТаблицы.НДС, 0);
			
			Если РасчетСуммыНДСПоСтавке Тогда
				СтрокаТаблицы.Сумма = СтрокаТаблицы.СуммаБезНДС + СтрокаТаблицы.НДС;
			Иначе
				СтрокаТаблицы.Сумма = СтрокаТаблицы.СуммаБезНДС + ?(ВключитьНДСВОсновнуюСумму, СтрокаТаблицы.НДС, 0);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЕстьВалюта тогда
		
		// Заполним валютные колонки суммами документа
		Для каждого Колонка Из СтруктураОбязательныхКолонок Цикл
			
			Если Прав(Колонка.Ключ, 3) = "Вал" Тогда
				ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку(Лев(Колонка.Ключ, СтрДлина(Колонка.Ключ) - 3)), Колонка.Ключ);
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ (Реквизиты.ВалютаДокумента = ВалютаРегламентированногоУчета) Тогда
			
			Если НЕ Реквизиты.Свойство("КурсДокумента") ИЛИ НЕ Реквизиты.Свойство("КратностьДокумента") тогда
				КоэффициентПересчета = 1;
			ИначеЕсли Число(Реквизиты.КурсДокумента) = 0 ИЛИ Число(Реквизиты.КратностьДокумента) = 0 тогда
				КоэффициентПересчета = 1;
			Иначе
				КоэффициентПересчета = Реквизиты.КурсДокумента/Реквизиты.КратностьДокумента;
			КонецЕсли;
			
			// Распределение суммы по таблице
			СуммаРег = Окр(ТаблицаЗначений.Итог("СуммаВал") * КоэффициентПересчета, 2);
			
			РаспределениеРег = РаспределитьПропорционально(СуммаРег, ТаблицаЗначений.ВыгрузитьКолонку("Сумма"));
			Если РаспределениеРег <> Неопределено Тогда
				ТаблицаЗначений.ЗагрузитьКолонку(РаспределениеРег,"Сумма");
			КонецЕсли; 
			
			Если ЕстьНДС Тогда
				
				Если РасчетСуммыНДСПоСтавке Тогда
					
					// Выделение суммы НДС, Расчет суммы без НДС
					Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
						
						ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС);
						Если СтрокаТаблицы.НДС = 0 Тогда
							СтрокаТаблицы.НДС = 0;
						Иначе
							СтрокаТаблицы.НДС = ?(ЗначениеСтавкиНДС = 0, 0, Окр(СтрокаТаблицы.Сумма * ЗначениеСтавкиНДС / (100 + ЗначениеСтавкиНДС), 2));
						КонецЕсли;
						
						СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма - СтрокаТаблицы.НДС;
						
					КонецЦикла;
					НДСРег = ТаблицаЗначений.Итог("НДС");
					
					// Корректировка таблицы
					Если НЕ ВключитьНДСВОсновнуюСумму Тогда
						ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБезНДС"), "Сумма");
						ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБезНДСВал"), "СуммаВал");
					КонецЕсли; 
				Иначе
					НДСРег = Окр(ТаблицаЗначений.Итог("НДСВал") * КоэффициентПересчета, 2);
					// Распределение суммы по таблице
					РаспределениеРег = РаспределитьПропорционально(НДСРег,ТаблицаЗначений.выгрузитьКолонку("НДС"));
					Если РаспределениеРег <> Неопределено Тогда
						ТаблицаЗначений.ЗагрузитьКолонку(РаспределениеРег, "НДС");
					КонецЕсли; 
					
					// Расчет суммы без НДС
					Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
						СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма - ?(ВключитьНДСВОсновнуюСумму, СтрокаТаблицы.НДС, 0);
					КонецЦикла;
				КонецЕсли; 
			КонецЕсли;
		Иначе
			
			// Документ в национальной валюте
			Если Реквизиты.РасчетыВУсловныхЕдиницах 
				ИЛИ (ТипЗнч(Реквизиты.Ссылка) = Тип("ДокументСсылка.ОтражениеНДСКВычету")
				И Реквизиты.ВалютаВзаиморасчетов <> ВалютаРегламентированногоУчета) Тогда
				
				// Необходимо определить сумму расчетов с контрагентом в валюте договора
				Если НЕ Реквизиты.Свойство("КурсВзаиморасчетов") ИЛИ НЕ Реквизиты.Свойство("КратностьВзаиморасчетов") Тогда
					КоэффициентПересчета = 1;
				ИначеЕсли Число(Реквизиты.КурсВзаиморасчетов) = 0 ИЛИ Число(Реквизиты.КратностьВзаиморасчетов) = 0 Тогда
					КоэффициентПересчета = 1;
				Иначе
					КоэффициентПересчета = Реквизиты.КратностьВзаиморасчетов / Реквизиты.КурсВзаиморасчетов;
				КонецЕсли;
				
				СуммаВал = Окр(ТаблицаЗначений.Итог("Сумма") * КоэффициентПересчета, 2);
				// Распределение суммы по таблице
				РаспределениеВал = РаспределитьПропорционально(СуммаВал,ТаблицаЗначений.ВыгрузитьКолонку("СуммаВал"));
				Если РаспределениеВал <> Неопределено Тогда
					ТаблицаЗначений.ЗагрузитьКолонку(РаспределениеВал, "СуммаВал");
				КонецЕсли; 
				
				
				Если ЕстьНДС Тогда
					
					НДСВал = Окр(ТаблицаЗначений.Итог("НДС") * КоэффициентПересчета, 2);
					// Распределение суммы по таблице
					РаспределениеВал = РаспределитьПропорционально(НДСВал,ТаблицаЗначений.ВыгрузитьКолонку("НДСВал"));
					Если РаспределениеВал <> Неопределено Тогда
						ТаблицаЗначений.ЗагрузитьКолонку(РаспределениеВал, "НДСВал");
					КонецЕсли; 
					
					// Расчет суммы без НДС
					Для каждого СтрокаТаблицы из ТаблицаЗначений Цикл
						СтрокаТаблицы.СуммаБезНДСВал = СтрокаТаблицы.СуммаВал - ?(ВключитьНДСВОсновнуюСумму, СтрокаТаблицы.НДСВал, 0);
					КонецЦикла;
					
					
				КонецЕсли;
				
			КонецЕсли
			
		КонецЕсли;
		
	КонецЕсли;
	
	// На этапе подготовки таблицы суммы для БУ совпадают с суммами для остальных видов учета (НУ, НДС...).
	// При зачете авансов в иностранной валюте в 2008 году суммы БУ будут корректироваться с учетом курсов зачтенных авансов,
	// а суммы для других видов учета остаются прежними
	
	ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("Сумма"), "СуммаБУ");
	Если ЕстьНДС Тогда
		ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБезНДС"), "СуммаБУБезНДС");
	КонецЕсли;
	
	ТаблицаЗначений.Колонки.Добавить("СуммаНУ", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	Если ЕстьНДС Тогда
		ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБУБезНДС"), "СуммаНУ");
	Иначе
		ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку("СуммаБУ"), "СуммаНУ");
	КонецЕсли;
	
КонецПроцедуры

Функция РаспределитьПропорционально(Знач РаспределяемаяСумма, Знач Коэффициенты, Знач Точность = 2) Экспорт

	Если Коэффициенты.Количество() = 0 Или Не ЗначениеЗаполнено(РаспределяемаяСумма) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИндексМаксимальногоКоэффициента = 0;
	МаксимальныйКоэффициент = 0;
	РаспределеннаяСумма = 0;
	СуммаКоэффициентов  = 0;
	
	Для Индекс = 0 По Коэффициенты.Количество() - 1 Цикл
		Коэффициент = Коэффициенты[Индекс];
		
		АбсолютноеЗначениеКоэффициента = ?(Коэффициент > 0, Коэффициент, -Коэффициент);
		Если МаксимальныйКоэффициент < АбсолютноеЗначениеКоэффициента Тогда
			МаксимальныйКоэффициент = АбсолютноеЗначениеКоэффициента;
			ИндексМаксимальногоКоэффициента = Индекс;
		КонецЕсли;
		
		СуммаКоэффициентов = СуммаКоэффициентов + Коэффициент;
	КонецЦикла;
	
	Если СуммаКоэффициентов = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Массив(Коэффициенты.Количество());
	
	Для Индекс = 0 По Коэффициенты.Количество() - 1 Цикл
		Результат[Индекс] = Окр(РаспределяемаяСумма * Коэффициенты[Индекс] / СуммаКоэффициентов, Точность, 1);
		РаспределеннаяСумма = РаспределеннаяСумма + Результат[Индекс];
	КонецЦикла;
	
	Дельта = РаспределяемаяСумма - РаспределеннаяСумма;
	
	Если Дельта > 0 Тогда 
		
		// Погрешности округления отнесем на коэффициент с максимальным весом.
		Если Не РаспределеннаяСумма = РаспределяемаяСумма Тогда
			Результат[ИндексМаксимальногоКоэффициента] = Результат[ИндексМаксимальногоКоэффициента] + Дельта;
		КонецЕсли;
		
	ИначеЕсли Дельта < 0 Тогда 
		
		// Если распределили больше чем положено, размазываем погрешность по ближайшим максимальным весам.
		ЗначениеПогрешности = 1 / Pow(10, Точность);
		КоличествоЭлементовПогрешности = -Дельта / ЗначениеПогрешности;
		
		КоэффициентыРешето = Новый Массив(Новый ФиксированныйМассив(Коэффициенты));
		
		Для Сч = 1 По КоличествоЭлементовПогрешности Цикл 
			МаксимальныйКоэффициент = МаксимальноеЗначениеВМассиве(КоэффициентыРешето);
			Индекс = КоэффициентыРешето.Найти(МаксимальныйКоэффициент);
			Результат[Индекс] = Результат[Индекс] - ЗначениеПогрешности;
			КоэффициентыРешето[Индекс] = 0;
		КонецЦикла;
		
	Иначе 
		// Если Дельта = 0, то все идеально.
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция МаксимальноеЗначениеВМассиве(Массив)
	
	// Рассчитываем, что на вход будет получен массив, в котором все элементы либо все положительные, либо отрицательные.
	// Поэтому для определения максимального значения сравниваем абсолютное значение элемента.
	//
	// В случае, если на вход получен массив, в котором элементы с разными знаками, то максимальное значение будет
	// определено не правильно. Но этот случай оставлен для совместимости с предыдущими версиями.
	
	МаксимальноеЗначение = 0;
	Множитель            = 1;
	Для Индекс = 0 По Массив.Количество() - 1 Цикл
		Значение = Массив[Индекс];
		АбсолютноеЗначение = ?(Значение> 0, Значение, -Значение);
		Если МаксимальноеЗначение < АбсолютноеЗначение Тогда
			МаксимальноеЗначение = АбсолютноеЗначение;
			Множитель = ?(Значение > 0, 1, -1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МаксимальноеЗначение * Множитель;
	
КонецФункции

Функция ТекстЗапросаТоварыИУслуги(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВременнаяТаблицаТоварыИУслугиИзОбъекта", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаТоварыИУслуги", НомераТаблиц.Количество());
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ТоварыИУслуги.Ссылка,
	|	ТоварыИУслуги.НомерСтроки,
	|	ТоварыИУслуги.Номенклатура,
	|	ТоварыИУслуги.ВидЦенности,
	|	ТоварыИУслуги.КодВидаОперации,
	|	ТоварыИУслуги.СтавкаНДС,
	|	ТоварыИУслуги.Сумма,
	|	ТоварыИУслуги.СуммаБезНДС,
	|	ТоварыИУслуги.СуммаВал,
	|	ТоварыИУслуги.СуммаБезНДСВал,
	|	ТоварыИУслуги.НДС,
	|	ТоварыИУслуги.НДСВал,
	|	ТоварыИУслуги.СуммаБУ,
	|	ТоварыИУслуги.НДС КАК СуммаНДСРуб,
	|	ТоварыИУслуги.СуммаБезНДС КАК СуммаБезНДСРуб,
	|	ТоварыИУслуги.СчетЗатрат,
	|	ТоварыИУслуги.СчетУчетаНДС,
	|	ТоварыИУслуги.Событие
	|ПОМЕСТИТЬ ТаблицаТоварыУслуги
	|ИЗ
	|	&ТаблицаТоварыУслуги КАК ТоварыИУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтражениеНДСКВычетуТоварыИУслуги.НомерСтроки,
	|	ОтражениеНДСКВычетуТоварыИУслуги.Номенклатура КАК Номенклатура,
	|	ОтражениеНДСКВычетуТоварыИУслуги.ВидЦенности КАК ВидЦенности,
	|	ОтражениеНДСКВычетуТоварыИУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ОтражениеНДСКВычетуТоварыИУслуги.Сумма КАК СуммаСНДС,
	|	ОтражениеНДСКВычетуТоварыИУслуги.Сумма КАК СуммаБУ,
	|	ОтражениеНДСКВычетуТоварыИУслуги.СуммаВал КАК СуммаВзаиморасчетов,
	|	ОтражениеНДСКВычетуТоварыИУслуги.СуммаБезНДС,
	|	ОтражениеНДСКВычетуТоварыИУслуги.НДС КАК СуммаНДС,
	|	ОтражениеНДСКВычетуТоварыИУслуги.СуммаВал,
	|	ОтражениеНДСКВычетуТоварыИУслуги.Сумма КАК СуммаРУБ,
	|	ОтражениеНДСКВычетуТоварыИУслуги.НДС КАК СуммаНДСРуб,
	|	ОтражениеНДСКВычетуТоварыИУслуги.СуммаБезНДС КАК СуммаБезНДСРуб,
	|	ОтражениеНДСКВычетуТоварыИУслуги.СчетЗатрат,
	|	ОтражениеНДСКВычетуТоварыИУслуги.СчетУчетаНДС КАК СчетУчетаНДС,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК Период2,
	|	ОтражениеНДСКВычету.Организация,
	|	ОтражениеНДСКВычету.Контрагент КАК Поставщик,
	|	ВЫБОР
	|		КОГДА ОтражениеНДСКВычету.ИспользоватьДокументРасчетовКакСчетФактуру
	|		И ОтражениеНДСКВычету.РасчетныйДокумент ССЫЛКА Документ.СчетФактураПолученный
	|			ТОГДА ВЫБОР
	|				КОГДА
	|					ОтражениеНДСКВычету.РасчетныйДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСчетФактураПолученный.Аванс)
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ ВЫРАЗИТЬ(ОтражениеНДСКВычету.РасчетныйДокумент КАК Документ.СчетФактураПолученный).Договор
	|			КОНЕЦ
	|		КОГДА ОтражениеНДСКВычету.ИспользоватьДокументРасчетовКакСчетФактуру
	|		И ОтражениеНДСКВычету.РасчетныйДокумент ССЫЛКА Документ.СчетФактура
	|			ТОГДА ВЫБОР
	|				КОГДА ОтражениеНДСКВычету.РасчетныйДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСчетФактура.Аванс)
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ ВЫРАЗИТЬ(ОтражениеНДСКВычету.РасчетныйДокумент КАК Документ.СчетФактура).Договор
	|			КОНЕЦ
	|		ИНАЧЕ ОтражениеНДСКВычету.Договор
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ОтражениеНДСКВычету.Ссылка КАК Регистратор,
	|	ОтражениеНДСКВычету.ЗаписьДополнительногоЛиста,
	|	ВЫБОР
	|		КОГДА ОтражениеНДСКВычету.ИспользоватьДокументРасчетовКакСчетФактуру
	|			ТОГДА &РасчетныйДокументКакСчетФактура
	|		ИНАЧЕ ОтражениеНДСКВычету.Ссылка
	|	КОНЕЦ КАК СчетФактура,
	|	ОтражениеНДСКВычету.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА ОтражениеНДСКВычетуТоварыИУслуги.Событие ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|				КОГДА ОтражениеНДСКВычету.ПрямаяЗаписьВКнигу
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПредъявленНДСКВычету)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПредъявленНДСПоставщиком)
	|			КОНЕЦ
	|		ИНАЧЕ ОтражениеНДСКВычетуТоварыИУслуги.Событие
	|	КОНЕЦ КАК Событие,
	|	ВЫБОР
	|		КОГДА ОтражениеНДСКВычету.ПрямаяЗаписьВКнигу
	|		И ОтражениеНДСКВычетуТоварыИУслуги.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыПолученные)
	|		ИЛИ ОтражениеНДСКВычетуТоварыИУслуги.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыПолученные0)
	|		ИЛИ ОтражениеНДСКВычетуТоварыИУслуги.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ВозвратАвансовПолученных)
	|			ТОГДА ОтражениеНДСКВычету.Дата
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ДатаОплаты,
	|	ВЫБОР
	|		КОГДА ОтражениеНДСКВычету.ПрямаяЗаписьВКнигу
	|			ТОГДА ОтражениеНДСКВычету.КорректируемыйПериод
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК КорректируемыйПериод,
	|	"""" КАК ДокументОплаты,
	|	ОтражениеНДСКВычету.Ссылка КАК Ссылка,
	|	ОтражениеНДСКВычетуТоварыИУслуги.КодВидаОперации
	|ПОМЕСТИТЬ ТоварыИУслуги
	|ИЗ
	|	ТаблицаТоварыУслуги КАК ОтражениеНДСКВычетуТоварыИУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтражениеНДСКВычету КАК ОтражениеНДСКВычету
	|		ПО ОтражениеНДСКВычетуТоварыИУслуги.Ссылка = ОтражениеНДСКВычету.Ссылка
	|ГДЕ
	|	ОтражениеНДСКВычетуТоварыИУслуги.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияУНФКлиентСервер.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаДокументыОплаты(НомераТаблиц)
	
	НомераТаблиц.Вставить("ТаблицаДокументыОплаты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОтражениеНДСКВычетуДокументыОплаты.ДокументОплаты,
	|	ОтражениеНДСКВычетуДокументыОплаты.ДатаОплаты,
	|	ОтражениеНДСКВычетуДокументыОплаты.СуммаОплаты,
	|	ОтражениеНДСКВычетуДокументыОплаты.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.Номер, """") КАК НомерДокументаОплаты,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДокументаОплаты
	|ИЗ
	|	Документ.ОтражениеНДСКВычету.ДокументыОплаты КАК ОтражениеНДСКВычетуДокументыОплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ОтражениеНДСКВычетуДокументыОплаты.ДокументОплаты = ДанныеПервичныхДокументов.Документ
	|			И ОтражениеНДСКВычетуДокументыОплаты.Ссылка.Организация = ДанныеПервичныхДокументов.Организация
	|ГДЕ
	|	ОтражениеНДСКВычетуДокументыОплаты.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияУНФКлиентСервер.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаПрямаяЗаписьВКнигуПокупок(НомераТаблиц)
	
	НомераТаблиц.Вставить("ПрямаяЗаписьВКнигуПокупок", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТоварыИУслуги.НомерСтроки КАК НомерСтроки,
	|	ТоварыИУслуги.Номенклатура,
	|	ТоварыИУслуги.ВидЦенности,
	|	ТоварыИУслуги.СтавкаНДС,
	|	ТоварыИУслуги.СуммаСНДС,
	|	ТоварыИУслуги.СуммаБезНДС,
	|	ТоварыИУслуги.СуммаНДС,
	|	ТоварыИУслуги.СчетЗатрат,
	|	ТоварыИУслуги.СчетУчетаНДС,
	|	ТоварыИУслуги.Период,
	|	ТоварыИУслуги.Организация,
	|	ТоварыИУслуги.Поставщик,
	|	ВЫБОР
	|		КОГДА ТоварыИУслуги.ВидЦенности В (&МассивВидовЦенностейУчитывающихсяПоДоговорам)
	|			ТОГДА ТоварыИУслуги.ДоговорКонтрагента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ТоварыИУслуги.ЗаписьДополнительногоЛиста,
	|	ТоварыИУслуги.СуммаВзаиморасчетов,
	|	ТоварыИУслуги.СуммаРУБ,
	|	ТоварыИУслуги.СуммаНДСРуб,
	|	ТоварыИУслуги.СуммаБезНДСРуб,
	|	ТоварыИУслуги.Регистратор,
	|	ТоварыИУслуги.СчетФактура,
	|	ТоварыИУслуги.Событие КАК Событие,
	|	ТоварыИУслуги.ДатаОплаты КАК ДатаОплаты,
	|	ТоварыИУслуги.ДокументОплаты КАК ДокументОплаты,
	|	ТоварыИУслуги.КорректируемыйПериод КАК КорректируемыйПериод,
	|	ТоварыИУслуги.КодВидаОперации КАК КодВидаОперации
	|ИЗ
	|	ТоварыИУслуги КАК ТоварыИУслуги
	|ГДЕ
	|	ТоварыИУслуги.Ссылка = &Ссылка
	|	И &ПрямаяЗаписьВКнигу = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияУНФКлиентСервер.ТекстРазделителяЗапросовПакета();
	
КонецФункции 

Функция ТекстЗапросаХозрасчетный(НомераТаблиц)
	
	НомераТаблиц.Вставить("ОтражениеНДСХозрасчетный", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТоварыИУслуги.НомерСтроки КАК НомерСтроки,
	|	ТоварыИУслуги.Номенклатура,
	|	ТоварыИУслуги.ВидЦенности,
	|	ТоварыИУслуги.СтавкаНДС,
	|	ТоварыИУслуги.СуммаСНДС,
	|	ТоварыИУслуги.СуммаБезНДС,
	|	ТоварыИУслуги.СуммаНДС,
	|	ТоварыИУслуги.СчетЗатрат,
	|	ТоварыИУслуги.СчетУчетаНДС,
	|	ТоварыИУслуги.Период,
	|	ТоварыИУслуги.Организация,
	|	ТоварыИУслуги.Поставщик,
	|	ТоварыИУслуги.ДоговорКонтрагента,
	|	ТоварыИУслуги.ЗаписьДополнительногоЛиста,
	|	ТоварыИУслуги.СуммаВзаиморасчетов,
	|	ТоварыИУслуги.СуммаРуб,
	|	ТоварыИУслуги.СуммаНДСРуб,
	|	ТоварыИУслуги.СуммаБезНДСРуб,
	|	ТоварыИУслуги.Регистратор,
	|	ТоварыИУслуги.СчетФактура,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК Налог,
	|	ТоварыИУслуги.Событие,
	|	ТоварыИУслуги.ДатаОплаты,
	|	ТоварыИУслуги.ДокументОплаты,
	|	ТоварыИУслуги.КорректируемыйПериод
	|ИЗ
	|	ТоварыИУслуги КАК ТоварыИУслуги
	|ГДЕ
	|	ТоварыИУслуги.Ссылка = &Ссылка
	|	И &ПрямаяЗаписьВКнигу = ИСТИНА
	|	И &ФормироватьПроводки = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияУНФКлиентСервер.ТекстРазделителяЗапросовПакета();
	
КонецФункции 

Функция ТекстЗапросаНДСПредъявленный(НомераТаблиц)
	
	НомераТаблиц.Вставить("ОтражениеНДСПредъявленный", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТоварыИУслуги.НомерСтроки КАК НомерСтроки,
	|	ТоварыИУслуги.Номенклатура,
	|	ТоварыИУслуги.ВидЦенности,
	|	ТоварыИУслуги.СтавкаНДС,
	|	ТоварыИУслуги.СуммаСНДС,
	|	ТоварыИУслуги.СуммаБезНДС,
	|	ТоварыИУслуги.СуммаНДС,
	|	ТоварыИУслуги.СчетЗатрат,
	|	ТоварыИУслуги.СчетУчетаНДС,
	|	ТоварыИУслуги.Период,
	|	ТоварыИУслуги.Организация,
	|	ТоварыИУслуги.Поставщик,
	|	ТоварыИУслуги.ДоговорКонтрагента,
	|	ТоварыИУслуги.ЗаписьДополнительногоЛиста,
	|	ТоварыИУслуги.СуммаВзаиморасчетов,
	|	ТоварыИУслуги.СуммаРУБ,
	|	ТоварыИУслуги.СуммаНДСРуб,
	|	ТоварыИУслуги.СуммаБезНДСРуб,
	|	ТоварыИУслуги.Регистратор,
	|	ТоварыИУслуги.СчетФактура,
	|	ТоварыИУслуги.Событие КАК Событие,
	|	ТоварыИУслуги.ДатаОплаты КАК ДатаОплаты,
	|	ТоварыИУслуги.ДокументОплаты КАК ДокументОплаты,
	|	ТоварыИУслуги.КорректируемыйПериод КАК КорректируемыйПериод
	|ИЗ
	|	ТоварыИУслуги КАК ТоварыИУслуги
	|ГДЕ
	|	ТоварыИУслуги.Ссылка = &Ссылка
	|	И &ПрямаяЗаписьВКнигу = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияУНФКлиентСервер.ТекстРазделителяЗапросовПакета();
	
КонецФункции 

Функция ТекстЗапросаРублевыеСуммыДокументовВВалюте(НомераТаблиц)
	
	НомераТаблиц.Вставить("РублевыеСуммыДокументовВВалюте", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	""ТоварыИУслуги"" КАК ИмяСписка,
	|	ТоварыИУслуги.Ссылка,
	|	ТоварыИУслуги.НомерСтроки,
	|	ТоварыИУслуги.СуммаБУ,
	|	ТоварыИУслуги.СуммаНДСРуб,
	|	ТоварыИУслуги.СуммаБезНДСРуб
	|ИЗ
	|	ТоварыИУслуги КАК ТоварыИУслуги";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияУНФКлиентСервер.ТекстРазделителяЗапросовПакета();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ДВИЖЕНИЙ

Процедура СформироватьДвиженияКнигиПокупок(ТаблицаПрямаяЗаписьВКнигуПокупок, ТаблицаДокументыОплаты, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Если Не ЗначениеЗаполнено(ТаблицаПрямаяЗаписьВКнигуПокупок) Тогда
	    Возврат;
	КонецЕсли;
	
	Параметры = ПодготовитьПараметрыДвиженияКнигиПокупок(ТаблицаПрямаяЗаписьВКнигуПокупок, ТаблицаРеквизиты);
	Реквизиты = ТаблицаРеквизиты[0];
	
	РаспределитьОплатыПоТаблицеТоваров(
		Реквизиты,
		Параметры.КнигаПокупок,
		ТаблицаДокументыОплаты);
	
	Для Каждого СтрокаТаблицы Из Параметры.КнигаПокупок Цикл
		
		Движение = Движения.НДСЗаписиКнигиПокупок.Добавить();
		
		Движение.Период      = Реквизиты.Период;
		Движение.Организация = Реквизиты.Организация;
		Движение.ДатаСобытия = Реквизиты.Период;
		
		Движение.Событие     = ?(СтрокаТаблицы.Событие = Перечисления.СобытияПоНДСПокупки.ПустаяСсылка(), 
			Перечисления.СобытияПоНДСПокупки.ПредъявленНДСПоставщиком, СтрокаТаблицы.Событие);
				
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТаблицы, ,"КорректируемыйПериод");

		Если СтрокаТаблицы.ЗаписьДополнительногоЛиста Тогда 
			Движение.КорректируемыйПериод = СтрокаТаблицы.КорректируемыйПериод;
		КонецЕсли;
		
		Движение.СуммаБезНДС = СтрокаТаблицы.СуммаБезНДСРуб;
		Движение.НДС         = СтрокаТаблицы.СуммаНДСРуб;
		
	КонецЦикла;
	
	Движения.НДСЗаписиКнигиПокупок.Записывать = Истина;
	
КонецПроцедуры

Процедура СформироватьДвиженияПоРегиструНДСПредъявленный(ТаблицаДокументыОплаты, ТаблицаНДСПредъявленный, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	ДокументыОплаты = ПодготовитьТаблицуДокументовОплаты(ТаблицаДокументыОплаты, ТаблицаРеквизиты[0]);
	Параметры = ПодготовитьПараметрыДвиженияНДСПредъявленный(ТаблицаНДСПредъявленный, ТаблицаРеквизиты);
	
	Реквизиты = ТаблицаРеквизиты[0];

	РаспределитьОплатыПоТаблице(ТаблицаНДСПредъявленный, ДокументыОплаты, Реквизиты);
		
	Для Каждого СтрокаДок Из ТаблицаНДСПредъявленный Цикл
		
		СтрокаДвижения = Движения.НДСПредъявленный.Добавить();
		
		СтрокаДвижения.Период      = Реквизиты.Период;
		СтрокаДвижения.Организация = Реквизиты.Организация;
		СтрокаДвижения.Поставщик   = Реквизиты.Контрагент;
		
		СтрокаДвижения.ВидЦенности = СтрокаДок.ВидЦенности;
		СтрокаДвижения.СчетФактура = ?(Реквизиты.ИспользоватьДокументРасчетовКакСчетФактуру, Реквизиты.РасчетныйДокумент,
			Реквизиты.Ссылка);
					
		СтрокаДвижения.СуммаБезНДС = СтрокаДок.СуммаБезНДС;
		СтрокаДвижения.НДС         = СтрокаДок.СуммаНДС;
		СтрокаДвижения.ДатаОплаты  = СтрокаДок.ДатаОплаты;
		
		СтрокаДвижения.СтавкаНДС = СтрокаДок.СтавкаНДС;
		СтрокаДвижения.СчетУчетаНДС = СтрокаДок.СчетУчетаНДС;
	
		Если Реквизиты.УчетАгентскогоНДС Тогда
			СтрокаДвижения.ДоговорКонтрагента = СтрокаДок.ДоговорКонтрагента; 
		КонецЕсли;
		СтрокаДвижения.ВидДвижения = ВидДвиженияНакопления.Приход;
		СтрокаДвижения.Событие = Перечисления.СобытияПоНДСПокупки.ПредъявленНДСПоставщиком;
		
	КонецЦикла;
	
	Движения.НДСПредъявленный.Записывать = Истина;
	
КонецПроцедуры

// Подготовка параметров для процедуры СформироватьДвиженияКнигиПокупок
//
// Параметры
//  ТаблицаКнигиПокупок   - <ТаблицаЗначений> - данные табличной части документа, по которым определяется, какие движения будут сформированы.
//                          Создается функцией ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженности
//  ТаблицаРеквизиты      - <ТаблицаЗначений> - реквизиты, необходимые для формирования движений.
//                          Создается в модуле менеджера документа
//
// Возвращаемое значение:
//   <Структура>   - структура из 2 таблиц: КнигаПокупок и Реквизиты
//
Функция ПодготовитьПараметрыДвиженияКнигиПокупок(ТаблицаКнигиПокупок, ТаблицаРеквизиты)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.Реквизиты
	
	СписокОбязательныхКолонок = ""
	+ "Период,"                     // <Дата> - период движений - дата документа
	+ "Организация,"                // <СправочникСсылка.Организации>
	+ "ВалютаДокумента,";           // <СправочникСсылка.Валюты>
	
	Параметры.Вставить("Реквизиты", ПрослеживаемостьПереопределяемый.ПолучитьТаблицуПараметровПроведения(
	ТаблицаРеквизиты, СписокОбязательныхКолонок));
	
	// Подготовка таблицы Параметры.КнигаПокупок
	
	СписокОбязательныхКолонок = ""
	+ "Организация,"                        // <СправочникСсылка.Организация>  - Организация
	+ "Поставщик,"                          // <СправочникСсылка.Контрагенты> - контрагент, 
	+ "ДоговорКонтрагента,"                 // <СправочникСсылка.ДоговорыКонтрагетов> - договор,
	+ "СчетФактура,"            			// <ДокументСсылка> - документ регистрации НДС
	+ "ВидЦенности,"              			// <ПеречислениеСсылка.ВидыЦенностей> 
	+ "КодВидаОперации,"              		// <Строка> 
	+ "СтавкаНДС,"                          // <ПеречислениеСсылка.СтавкиНДС> - Ставка НДС
	+ "СчетУчетаНДС,"                       // <ПланСчетовСсылка.Хозрасчетный> - счет учета НДС
	+ "ДатаОплаты,"                         // <Дата> - дата документа оплаты
	+ "Событие,"                            // <ПеречислениеСсылка.СобытияПоНДСПокупки>
	+ "Период,"                             // <Дата> - период движений
	+ "ЗаписьДополнительногоЛиста,"         // <Булево> - Запись Доп. листа
	+ "КорректируемыйПериод,"               // <Дата> 
	+ "СуммаБезНДСРуб,"                     // <Число,15,2> - сумма в рублях Без НДС
	+ "СуммаНДСРуб";                        // <Число,15,2> - сумма в рублях НДС	
	
	Параметры.Вставить("КнигаПокупок", ПрослеживаемостьПереопределяемый.ПолучитьТаблицуПараметровПроведения(
		ТаблицаКнигиПокупок, СписокОбязательныхКолонок));
	
	Возврат Параметры;
	
КонецФункции

Функция ПодготовитьТаблицуДокументовОплаты(ТаблицаДокументовОплаты, Реквизиты)
	
	СписокОбязательныхКолонок = ""
		+ "ДатаОплаты,"
		+ "ДокументОплаты,"
		+ "СуммаОплаты,"
		+ "НомерСтроки,";
		
	ДокументыОплаты = ПрослеживаемостьПереопределяемый.ПолучитьТаблицуПараметровПроведения(
		ТаблицаДокументовОплаты, СписокОбязательныхКолонок);
	
	ДокументыОплаты.Колонки.Добавить("Период");
	ДокументыОплаты.Колонки.Добавить("Активность");
	ДокументыОплаты.Колонки.Добавить("Организация");
	ДокументыОплаты.Колонки.Добавить("Поставщик");
	ДокументыОплаты.Колонки.Добавить("ДоговорКонтрагента");
	ДокументыОплаты.Колонки.Добавить("Событие");
	ДокументыОплаты.Колонки.Добавить("СчетФактура");
	ДокументыОплаты.Колонки.Добавить("ДокументРасчетов");
	ДокументыОплаты.Колонки.Добавить("ДатаДокументаРасчетов");
	ДокументыОплаты.Колонки.Добавить("ЗаписьДополнительногоЛиста");
	ДокументыОплаты.Колонки.Добавить("КорректируемыйПериод");
	ДокументыОплаты.Колонки.Добавить("СуммаБУ");
	
	ДокументыОплаты.ЗаполнитьЗначения(Реквизиты.Организация, "Организация");
	ДокументыОплаты.ЗаполнитьЗначения(Реквизиты.Контрагент, "Поставщик");
	Если Реквизиты.ИспользоватьДокументРасчетовКакСчетФактуру Тогда

		РасчетныйДокументКакСчетФактура = УчетНДСПереопределяемый.ПолучитьСчетФактуруДляЗаписиВРегистрыНДС(Реквизиты.РасчетныйДокумент);
	    ДокументыОплаты.ЗаполнитьЗначения(РасчетныйДокументКакСчетФактура, "СчетФактура");

	Иначе
		ДокументыОплаты.ЗаполнитьЗначения(Реквизиты.Ссылка, "СчетФактура");
	КонецЕсли;
	ДокументыОплаты.ЗаполнитьЗначения(Перечисления.СобытияПоНДСПокупки.ПредъявленНДСКВычету, "Событие");
	ДокументыОплаты.ЗаполнитьЗначения(Реквизиты.ЗаписьДополнительногоЛиста, "ЗаписьДополнительногоЛиста");
	ДокументыОплаты.ЗаполнитьЗначения(Реквизиты.КорректируемыйПериод, "КорректируемыйПериод");
	
	Если Реквизиты.УчетАгентскогоНДС Тогда
		ДокументыОплаты.ЗаполнитьЗначения(Реквизиты.ДоговорКонтрагента, "ДоговорКонтрагента");
	КонецЕсли;
	
	ДокументыОплаты.ЗагрузитьКолонку(ДокументыОплаты.ВыгрузитьКолонку("ДокументОплаты"), 
		"ДокументРасчетов");
	ДокументыОплаты.ЗагрузитьКолонку(ДокументыОплаты.ВыгрузитьКолонку("ДатаОплаты"), 
		"ДатаДокументаРасчетов");
	ДокументыОплаты.ЗагрузитьКолонку(ДокументыОплаты.ВыгрузитьКолонку("СуммаОплаты"), "СуммаБУ");
	
	ДокументыОплаты.Свернуть("Период, Активность, Организация, Поставщик, ДоговорКонтрагента, Событие, 
		|СчетФактура, ДокументРасчетов, ДатаОплаты, ДатаДокументаРасчетов, ДокументОплаты, ЗаписьДополнительногоЛиста,
		|КорректируемыйПериод", "СуммаОплаты, СуммаБУ");
	
	Возврат ДокументыОплаты;
	
КонецФункции

// Подготовка параметров для процедуры СформироватьДвиженияКнигиПокупок
//
// Параметры
//  ТаблицаКнигиПокупок   - <ТаблицаЗначений> - данные табличной части документа, по которым определяется, какие движения будут сформированы.
//                          Создается функцией ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженности
//  ТаблицаРеквизиты      - <ТаблицаЗначений> - реквизиты, необходимые для формирования движений.
//                          Создается в модуле менеджера документа
//
// Возвращаемое значение:
//   <Структура>   - структура из 2 таблиц: КнигаПокупок и Реквизиты
//
Функция ПодготовитьПараметрыДвиженияНДСПредъявленный(ТаблицаНДСПредъявленный, ТаблицаРеквизиты)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.Реквизиты
	
	СписокОбязательныхКолонок = ""
	+ "Период,"                     // <Дата> - период движений - дата документа
	+ "Организация,"                // <СправочникСсылка.Организации>
	+ "ВалютаДокумента,";           // <СправочникСсылка.Валюты>
	
	Параметры.Вставить("Реквизиты", ПрослеживаемостьПереопределяемый.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизиты, СписокОбязательныхКолонок));
	
	// Подготовка таблицы Параметры.КнигаПокупок
	
	СписокОбязательныхКолонок = ""
	+ "Организация,"                        // <СправочникСсылка.Организация>  - Организация
	+ "Поставщик,"                          // <СправочникСсылка.Контрагенты> - контрагент, 
	+ "СчетФактура,"            			// <ДокументСсылка> - документ регистрации НДС
	+ "ВидЦенности,"              			// <ПеречислениеСсылка.ВидыЦенностей> 
	+ "СтавкаНДС,"                          // <ПеречислениеСсылка.СтавкиНДС> - Ставка НДС
	+ "СчетУчетаНДС,"                       // <ПланСчетовСсылка.Хозрасчетный> - счет учета НДС
	+ "ДатаОплаты,"                         // <Дата> - дата документа оплаты
	+ "ДокументОплаты,"                     // <ДокументСсылка> - документ оплаты
	+ "Событие,"                            // <ПеречислениеСсылка.СобытияПоНДСПокупки>
	+ "Период,"                             // <Дата> - период движений
	+ "ЗаписьДополнительногоЛиста,"         // <Булево> - Запись Доп. листа
	+ "КорректируемыйПериод,"               // <Дата> 
	+ "СуммаБезНДСРуб,"                     // <Число,15,2> - сумма в рублях Без НДС
	+ "СуммаНДСРуб";                        // <Число,15,2> - сумма в рублях НДС	
	Параметры.Вставить("НДСПредъявленный", ПрослеживаемостьПереопределяемый.ПолучитьТаблицуПараметровПроведения(
		ТаблицаНДСПредъявленный, СписокОбязательныхКолонок));
	
	Возврат Параметры;
	
КонецФункции

//Процедура распределяет таблицыНДС и таблицу оплат для движений
//по регистру НДСЗаписиКнигиПокупок
Процедура РаспределитьОплатыПоТаблицеТоваров(Реквизиты, ТаблицаПоТоварам, ТаблицаПоДокументамОплаты)
	
	СтрокиКУдалению = Новый Массив;
	ТаблицаПоТоварам.Колонки.Добавить("ДокументОплаты");
	ТаблицаПоТоварам.Колонки.Добавить("СуммаОплаты",          ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ТаблицаПоТоварам.Колонки.Добавить("НомерДокументаОплаты", ОбщегоНазначения.ОписаниеТипаСтрока(30));
	ТаблицаПоТоварам.Колонки.Добавить("ДатаДокументаОплаты",  ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	
	УчетНДСПоПостановлению735 = УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(Реквизиты.Период) >= 3;
	
	Для Каждого СтрокаДокументОплаты Из ТаблицаПоДокументамОплаты Цикл
		
		Если СтрокаДокументОплаты.СуммаОплаты = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаТовар Из ТаблицаПоТоварам Цикл
			
			Если НЕ Перечисления.ВидыЦенностей.УчитываетсяПоДоговорам(СтрокаТовар.ВидЦенности) Тогда
				СтрокаТовар.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
			КонецЕсли;
			
			Если Перечисления.ВидыЦенностей.ЭтоНалоговыйАгент(СтрокаТовар.ВидЦенности) Тогда
				СуммаПоСтроке = СтрокаТовар.СуммаБезНДСРуб;
			Иначе
				СуммаПоСтроке = СтрокаТовар.СуммаБезНДСРуб + СтрокаТовар.СуммаНДСРуб;
			КонецЕсли;
			
			Если СуммаПоСтроке = СтрокаТовар.СуммаОплаты Тогда
				Продолжить;
			КонецЕсли;
			
			СуммаОплаты = Мин(СтрокаДокументОплаты.СуммаОплаты, СуммаПоСтроке - СтрокаТовар.СуммаОплаты);
			СтрокаТовар.СуммаОплаты = СтрокаТовар.СуммаОплаты + СуммаОплаты;
			СтрокаДокументОплаты.СуммаОплаты = СтрокаДокументОплаты.СуммаОплаты - СуммаОплаты;
			
			Если УчетНДСПоПостановлению735 Тогда
				Если Перечисления.ВидыЦенностей.ЭтоНалоговыйАгент(СтрокаТовар.ВидЦенности) Тогда
					// Документ оплаты необходим для поиска счета-фактуры налогового агента.
					СтрокаТовар.ДокументОплаты = СтрокаДокументОплаты.ДокументОплаты;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(СтрокаТовар, СтрокаДокументОплаты, "НомерДокументаОплаты,ДатаДокументаОплаты");
			Иначе
				ЗаполнитьЗначенияСвойств(СтрокаТовар, СтрокаДокументОплаты, "ДатаОплаты,ДокументОплаты");
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрокаДокументОплаты.СуммаОплаты = 0 Тогда
			СтрокиКУдалению.Добавить(СтрокаДокументОплаты);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		ТаблицаПоДокументамОплаты.Удалить(СтрокаКУдалению);
	КонецЦикла;
	
	ТаблицаПоТоварам.Колонки.Удалить("СуммаОплаты");
	
КонецПроцедуры

//Процедура распределяет таблицыНДС и таблицу оплат для движений
//по регистру НДСПредъявленный
Процедура РаспределитьОплатыПоТаблице(ТаблицаНДС, ТаблицаОплат, Реквизиты)
	
	Если Не ЗначениеЗаполнено(ТаблицаОплат) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаОплат.Колонки.Найти("РаспределеннаяСуммаДляНДС") = Неопределено Тогда
		ТаблицаОплат.Колонки.Добавить("РаспределеннаяСуммаДляНДС", 
			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	КонецЕсли;
	
	МассивСумм = Новый Массив;

	Для Каждого СтрокаНДС Из ТаблицаНДС Цикл
		
		Если Перечисления.ВидыЦенностей.УчитываетсяПоДоговорам(СтрокаНДС.ВидЦенности) Тогда 
			СтрокаНДС.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
		
		Если Перечисления.ВидыЦенностей.ЭтоНалоговыйАгент(СтрокаНДС.ВидЦенности) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТаблицаОплат.Колонки.Найти("Контрагент") <> Неопределено
			И ТаблицаНДС.Колонки.Найти("Покупатель") <> Неопределено Тогда
			ОплатыСОтбором = ТаблицаОплат.НайтиСтроки(Новый Структура("Контрагент", СтрокаНДС.Покупатель));
		Иначе
			ОплатыСОтбором = ТаблицаОплат;
		КонецЕсли;
		
		Для Каждого СтрокаОплаты Из ОплатыСОтбором Цикл
			
			Если (СтрокаОплаты.ДокументРасчетов = СтрокаНДС.СчетФактура) Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаОплаты.СуммаБУ - СтрокаОплаты.РаспределеннаяСуммаДляНДС = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			СуммаТаблицыНДС = СтрокаНДС.СуммаБезНДС + СтрокаНДС.СуммаНДС;
			СуммаОплаты = ?(СуммаТаблицыНДС > СтрокаОплаты.СуммаБУ - СтрокаОплаты.РаспределеннаяСуммаДляНДС, 
				СтрокаОплаты.СуммаБУ - СтрокаОплаты.РаспределеннаяСуммаДляНДС, 
				СуммаТаблицыНДС);
			СтрокаОплаты.РаспределеннаяСуммаДляНДС = СтрокаОплаты.РаспределеннаяСуммаДляНДС + СуммаОплаты;
			
			Если СуммаОплаты < СуммаТаблицыНДС Тогда
				
				// Распределение колонок СуммаБезНДС, НДС
				МассивСумм.Очистить();
				МассивСумм.Добавить(СтрокаНДС.СуммаБезНДС);
				МассивСумм.Добавить(СтрокаНДС.СуммаНДС);
				МассивРаспределенныхСумм = ОбщегоНазначенияУНФКлиентСервер.РаспределитьПропорционально(СуммаОплаты, МассивСумм);
				
				НоваяСтрока = ТаблицаНДС.Вставить(ТаблицаНДС.Индекс(СтрокаНДС) + 1);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНДС);
				НоваяСтрока.СуммаНДС = СтрокаНДС.СуммаНДС - МассивРаспределенныхСумм[1];
				НоваяСтрока.СуммаБезНДС = СтрокаНДС.СуммаБезНДС - МассивРаспределенныхСумм[0];
				
				СтрокаНДС.СуммаБезНДС = СтрокаНДС.СуммаБезНДС - НоваяСтрока.СуммаБезНДС;
				СтрокаНДС.СуммаНДС = СтрокаНДС.СуммаНДС - НоваяСтрока.СуммаНДС;
				
			КонецЕсли;
			
			СтрокаНДС.ДатаОплаты = СтрокаОплаты.ДатаДокументаРасчетов;
			
			Прервать;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
КонецПроцедуры

#КонецЕсли
